src/SSL.Chat2Desk/src/InformationRegisters/C2D_Кэш/C2D_Кэш.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>C2D_Кэш</name>
  <resources>
    <name>ХранилищеКэша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДатаХэширования</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ХэшЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/SSL.Chat2Desk/src/InformationRegisters/C2D_Кэш/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
Функция ВернутьДанныеКэша(Хэш) экспорт
	ДанныеКэша = Неопределено;
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	C2D_Кэш.ХранилищеКэша КАК ХранилищеКэша
	|ИЗ
	|	РегистрСведений.C2D_Кэш КАК C2D_Кэш
	|ГДЕ
	|	C2D_Кэш.ХэшЗапроса = &ХэшЗапроса
	|	И C2D_Кэш.ДатаХэширования >= ДОБАВИТЬКДАТЕ(&текущаяДата, день, -1)";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ХэшЗапроса", Хэш);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеКэша = Выборка.ХранилищеКэша.Получить();
	КонецЕсли;
	
	Возврат ДанныеКэша;
КонецФункции

// Проедура - Кэшировать данные
//
// Параметры:
//  Данные	 - ПроизвольноеЗначение	 - Значение которое будет помещено в хранилище
//  Хэш		 - Строка	 - Хэш-сумма, ключ уникальности данных. Получается функцией C2D_ВзаимодействиеСКэшированиемПовтИсп.ПолучитьХэш(Структура)
// 
Процедура КэшироватьДанные(Данные, Хэш) экспорт
	Запись = РегистрыСведений.C2D_Кэш.СоздатьМенеджерЗаписи();
	Запись.ДатаХэширования = ТекущаяДата();
	Запись.ХранилищеКэша = Новый ХранилищеЗначения(Данные);
	Запись.ХэшЗапроса = Хэш;
	Запись.Записать(Истина);
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
